Autodesk.Revit.DB.Segment.GetSizes
Gets the defined sizes of the segment.
Since:
2013

Autodesk.Revit.DB.Segment.RemoveSize(System.Double)
Remove the existing MEPSize with this nominal diameter from the segment.
Remarks:
Does nothing if there is no existing MEPSize with this nominal diameter.
nominalDiameter:
The nominal diameter of the size.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The last size of the segment cannot be removed.
Since:
2013

Autodesk.Revit.DB.Segment.AddSize(Autodesk.Revit.DB.MEPSize)
Adds a new MEPSize to the segment.
size:
The new MEPSize to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is already a same size in the settings.
-or-
The size already exists in the segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.Segment.SizeCount
The number of size objects in the segment.
Since:
2013

Autodesk.Revit.DB.Segment.MaterialId
The ElementId of the MaterialElem.
Since:
2013

Autodesk.Revit.DB.Segment.Roughness
The roughness value for given material.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.Segment.Description
The description of the segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.Segment
This element represents a segment of an MEP curve object.
Remarks:
Currently, only pipe curves can be broken into separate segment elements.
Since:
2013